system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5 0 0)
    (50 0 0)
    (50  8 0)
    (-5  8 0)
    (-5 0 1)
    (50 0 1)
    (50  8 1)
    (-5  8 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (22 8 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
//            (3 7 6 2)
//            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
//            (0 3 2 1)
            (1 5 4 0)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
//            (4 5 6 7)
            (3 7 6 2)
        );
    }
);

// ************************************************************************* //
