constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1373;
        startFace       26686;
    }
    inlet
    {
        type            patch;
        nFaces          8;
        startFace       28059;
    }
    outlet
    {
        type            patch;
        nFaces          77;
        startFace       28067;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          308;
        startFace       28144;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          22;
        startFace       28452;
    }
    auto
    {
        type            patch;
        inGroups        1(motorBikeGroup);
        nFaces          1632;
        startFace       28474;
    }
    camion
    {
        type            patch;
        inGroups        1(motorBikeGroup);
        nFaces          2075;
        startFace       30106;
    }
)

// ************************************************************************* //
