0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    camion   
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    
//    camion
//    {
 //       type            fixedValue;
//        value           uniform (0 0 0);
 //   }

	auto
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    upperWall   
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    lowerWall   
    {
    type            movingWallVelocity;
    value           uniform (10 0 0);
    }
 //   {
 //       type            fixedValue;
 //       value           uniform (0 0 0);
//    }
    
//    walls
//    {
//        type            empty;
//    }
    frontAndBack
    {
        type            empty;
    }
}




// ************************************************************************* //
