0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    upperWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    
    camion
    {
        type            zeroGradient;
    }
    
    auto
    {
        type            zeroGradient;
    }

    frontAndBack
   {
        type            empty;
   }
//    wall
//    {
 //       type            empty;
 //   }
 //   ".*"
 //   {
 //       type            zeroGradient;
 //   }

}

// ************************************************************************* //
