0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		$internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    camion
    {
        type            zeroGradient;
    }    
    auto
    {
        type            zeroGradient;
    }

//    {
//        type            fixedValue;
 //       value 		uniform 0;
 //   }
 
//    wall
//    {
//        type            empty;
 //   }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
