0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    upperWall
    {
        type            nutUSpaldingWallFunction;
 //       Cmu             0.09;
//        kappa           0.41;
//        E               9.8;
        value           $internalField;
    }
    lowerWall
    {
        type            nutUSpaldingWallFunction;
 //       Cmu             0.09;
//        kappa           0.41;
 //       E               9.8;
        value           $internalField;
    }
       
    auto
    {
        type            calculated;
  //      Cmu             0.09;
  //      kappa           0.41;
  //      E               9.8;
        value           $internalField;
    }
    
    camion
    {
        type            calculated;
 //       Cmu             0.09;
 //       kappa           0.41;
 //       E               9.8;
        value           $internalField;
    }
    
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }

//    frontAndBack
//    {
//        type            empty;
 //   }

//    ".*"
//    {
//        type            calculated;
//        value           $internalField;
//    }
}


// ************************************************************************* //
