system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
//    default faceLimited leastSquares 1.0;
}

divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss upwind;
//    div(phi,k)      bounded Gauss upwind;
//    div(phi,epsilon) bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
//    div(phi,nuTilda) bounded Gauss linearUpwind grad(nuTilda);
    div(phi,nuTilda) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
//   default Gauss corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;    // Optionally correct distance from near-wall cells to the boundary
//    correctWalls    true;
}

// ************************************************************************* //
