system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;
    libs            (forces);
    writeControl    writeTime;
    writeFields     true;

    patches         (auto);
    p               p;
    U               U;
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1;           // Required when rhopara = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (1 0 0);  // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         1;
    lRef            4;          // Wheelbase length
    Aref            2;          // Estimated
    porosity        off;

//    binData
 //   {
//        nBin            20;          // output data into 20 bins
 //       direction       (0 1 0);     // bin direction
//        cumulative      yes;
//    }
}


// ************************************************************************* //
